# NaN - Not a Number

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan
type(n)

float

In [3]:
# 任何数值（整数、浮点数、0）与 NaN 作运算结果都是 NaN
m = 1
m + n

nan

## NaN in Series

In [4]:
s1 = pd.Series([1, 2, np.nan, 3, 4], index=['A', 'B', 'C', 'D', 'E'])
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [5]:
# 判断 Series 中的值是否是 NaN
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [6]:
# 判断 Series 中的值是否不是 NaN
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [7]:
 # 删除 Series 中的值是 NaN 的数据
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

## Nan in DataFrame

In [8]:
df1 = pd.DataFrame([[1, 2, 3], [np.nan, 5, 6], [7, np.nan, 9], [np.nan, np.nan, np.nan]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [9]:
df1.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [10]:
df1.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [11]:
df1.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [12]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
df1.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [14]:
df2 = pd.DataFrame([[np.nan, 5, 6], [7, np.nan, np.nan], [np.nan, np.nan, np.nan]])
df2

     0    1    2
0  NaN  5.0  6.0
1  7.0  NaN  NaN
2  NaN  NaN  NaN

In [15]:
# thresh 表示范围 删除少于 3 个非 NaN 值的行或列
df2.dropna(thresh=2)

    0    1    2
0 NaN  5.0  6.0

In [16]:
# 替换值为 NaN 的值
df2.fillna(value=1)

     0    1    2
0  1.0  5.0  6.0
1  7.0  1.0  1.0
2  1.0  1.0  1.0

In [17]:
# 按列替换值为 NaN 的值
df2.fillna(value={0:0, 1:1, 2:2})

     0    1    2
0  0.0  5.0  6.0
1  7.0  1.0  2.0
2  0.0  1.0  2.0